# 学院专业配置
DEPARTMENTS = {
    '软件学院': {
        'icon': 'fa-code',
        'majors': [
            '软件技术',
            '信息安全技术应用',
            '动漫制作技术',
            '区块链技术应用',
            '云计算技术应用',
            '计算机网络技术'
        ]
    },
    '人工智能学院': {
        'icon': 'fa-robot',
        'majors': [
            '人工智能技术应用',
            '大数据技术',
            '计算机网络技术',
            '移动互联应用技术',
            '嵌入式技术应用'
        ]
    },
    '艺术设计学院': {
        'icon': 'fa-paint-brush',
        'majors': [
            '室内艺术设计',
            '数字媒体艺术设计',
            '服装与服饰设计',
            '环境艺术设计',
            '陶瓷设计与工艺',
            '皮具艺术设计'
        ]
    },
    '智能装备技术学院': {
        'icon': 'fa-cogs',
        'majors': [
            '机电一体化技术',
            '工业机器人技术',
            '机械制造及自动化',
            '数字化设计与制造技术',
            '工业产品质量检测技术',
            '低空飞行器装备技术'
        ]
    },
    '商学院': {
        'icon': 'fa-briefcase',
        'majors': [
            '大数据与会计',
            '电子商务',
            '跨境电子商务',
            '市场营销',
            '商务管理',
            '现代物流管理'
        ]
    },
    '药学院': {
        'icon': 'fa-medkit',
        'majors': [
            '药学',
            '药品生产技术',
            '药品质量与安全'
        ]
    },
    '人文与音乐学院': {
        'icon': 'fa-music',
        'majors': [
            '现代文秘',
            '音乐表演'
        ]
    }
}